; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared3 - mode
	infrared2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation7 - direction
	Star20 - direction
	GroundStation21 - direction
	Star23 - direction
	GroundStation14 - direction
	Star6 - direction
	Star0 - direction
	GroundStation15 - direction
	Star2 - direction
	Star3 - direction
	Star19 - direction
	Star18 - direction
	GroundStation11 - direction
	Star13 - direction
	Star12 - direction
	Star22 - direction
	Star10 - direction
	GroundStation17 - direction
	GroundStation5 - direction
	Star4 - direction
	GroundStation24 - direction
	GroundStation8 - direction
	GroundStation16 - direction
	Star9 - direction
	Planet25 - direction
	Star26 - direction
	Phenomenon27 - direction
	Planet28 - direction
	Star29 - direction
	Star30 - direction
	Phenomenon31 - direction
	Phenomenon32 - direction
	Phenomenon33 - direction
	Planet34 - direction
	Planet35 - direction
	Star36 - direction
	Star37 - direction
	Phenomenon38 - direction
	Planet39 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation14)
	(supports instrument1 infrared3)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star18)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation15)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star19)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation24)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star18)
	(calibration_target instrument3 Star19)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star22)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation17)
	(calibration_target instrument5 Star10)
	(calibration_target instrument5 Star22)
	(calibration_target instrument5 Star4)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation16)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 GroundStation24)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
)
(:goal (and
	(pointing satellite2 Star0)
	(have_image Planet25 thermograph1)
	(have_image Star26 spectrograph0)
	(have_image Phenomenon27 spectrograph0)
	(have_image Planet28 infrared3)
	(have_image Star29 infrared3)
	(have_image Star30 thermograph1)
	(have_image Phenomenon31 spectrograph0)
	(have_image Phenomenon32 infrared3)
	(have_image Phenomenon33 infrared3)
	(have_image Planet34 spectrograph0)
	(have_image Planet35 infrared2)
	(have_image Star36 spectrograph0)
	(have_image Star37 infrared2)
	(have_image Phenomenon38 infrared2)
	(have_image Planet39 infrared2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 16
2. (calibrate satellite1 instrument3 groundstation11)
   added: (calibrated instrument3)
   goals met: 0 of 16
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 16
4. (turn_to satellite2 star0 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star0)
   goals met: 1 of 16
5. (turn_to satellite1 phenomenon27 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 phenomenon27)
   goals met: 1 of 16
6. (take_image satellite1 phenomenon27 instrument3 spectrograph0)
   added: (have_image phenomenon27 spectrograph0)
   goals met: 2 of 16
7. (turn_to satellite1 phenomenon31 phenomenon27)
   deleted: (pointing satellite1 phenomenon27)
   added: (pointing satellite1 phenomenon31)
   goals met: 2 of 16
8. (take_image satellite1 phenomenon31 instrument3 spectrograph0)
   added: (have_image phenomenon31 spectrograph0)
   goals met: 3 of 16
9. (turn_to satellite1 planet25 phenomenon31)
   deleted: (pointing satellite1 phenomenon31)
   added: (pointing satellite1 planet25)
   goals met: 3 of 16
10. (take_image satellite1 planet25 instrument3 thermograph1)
   added: (have_image planet25 thermograph1)
   goals met: 4 of 16
11. (turn_to satellite1 planet34 planet25)
   deleted: (pointing satellite1 planet25)
   added: (pointing satellite1 planet34)
   goals met: 4 of 16
12. (take_image satellite1 planet34 instrument3 spectrograph0)
   added: (have_image planet34 spectrograph0)
   goals met: 5 of 16
13. (turn_to satellite1 star26 planet34)
   deleted: (pointing satellite1 planet34)
   added: (pointing satellite1 star26)
   goals met: 5 of 16
14. (take_image satellite1 star26 instrument3 spectrograph0)
   added: (have_image star26 spectrograph0)
   goals met: 6 of 16
15. (turn_to satellite1 star30 star26)
   deleted: (pointing satellite1 star26)
   added: (pointing satellite1 star30)
   goals met: 6 of 16
16. (take_image satellite1 star30 instrument3 thermograph1)
   added: (have_image star30 thermograph1)
   goals met: 7 of 16
17. (turn_to satellite1 star36 star30)
   deleted: (pointing satellite1 star30)
   added: (pointing satellite1 star36)
   goals met: 7 of 16
18. (take_image satellite1 star36 instrument3 spectrograph0)
   added: (have_image star36 spectrograph0)
   goals met: 8 of 16
19. (turn_to satellite0 phenomenon32 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 phenomenon32)
   goals met: 8 of 16
20. (turn_to satellite0 star6 phenomenon32)
   deleted: (pointing satellite0 phenomenon32)
   added: (pointing satellite0 star6)
   goals met: 8 of 16
21. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 8 of 16
22. (turn_to satellite0 phenomenon32 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon32)
   goals met: 8 of 16
23. (take_image satellite0 phenomenon32 instrument1 infrared3)
   added: (have_image phenomenon32 infrared3)
   goals met: 9 of 16
24. (turn_to satellite0 phenomenon33 phenomenon32)
   deleted: (pointing satellite0 phenomenon32)
   added: (pointing satellite0 phenomenon33)
   goals met: 9 of 16
25. (take_image satellite0 phenomenon33 instrument1 infrared3)
   added: (have_image phenomenon33 infrared3)
   goals met: 10 of 16
26. (turn_to satellite0 phenomenon38 phenomenon33)
   deleted: (pointing satellite0 phenomenon33)
   added: (pointing satellite0 phenomenon38)
   goals met: 10 of 16
27. (take_image satellite0 phenomenon38 instrument1 infrared2)
   added: (have_image phenomenon38 infrared2)
   goals met: 11 of 16
28. (turn_to satellite0 planet28 phenomenon38)
   deleted: (pointing satellite0 phenomenon38)
   added: (pointing satellite0 planet28)
   goals met: 11 of 16
29. (take_image satellite0 planet28 instrument1 infrared3)
   added: (have_image planet28 infrared3)
   goals met: 12 of 16
30. (turn_to satellite0 planet35 planet28)
   deleted: (pointing satellite0 planet28)
   added: (pointing satellite0 planet35)
   goals met: 12 of 16
31. (take_image satellite0 planet35 instrument1 infrared2)
   added: (have_image planet35 infrared2)
   goals met: 13 of 16
32. (turn_to satellite0 planet39 planet35)
   deleted: (pointing satellite0 planet35)
   added: (pointing satellite0 planet39)
   goals met: 13 of 16
33. (take_image satellite0 planet39 instrument1 infrared2)
   added: (have_image planet39 infrared2)
   goals met: 14 of 16
34. (turn_to satellite0 star29 planet39)
   deleted: (pointing satellite0 planet39)
   added: (pointing satellite0 star29)
   goals met: 14 of 16
35. (take_image satellite0 star29 instrument1 infrared3)
   added: (have_image star29 infrared3)
   goals met: 15 of 16
36. (turn_to satellite0 star37 star29)
   deleted: (pointing satellite0 star29)
   added: (pointing satellite0 star37)
   goals met: 15 of 16
37. (take_image satellite0 star37 instrument1 infrared2)
   added: (have_image star37 infrared2)
   goals met: 16 of 16
